In [1]:
import pandas as pd
data={
'Year':['2018','2019','2018','2019','2018','2019'],
'Team':['MI','MI','RCB','RCB','CSK','CSK'],
'Runs':[2500,2650,2200,2400,2300,2700]}
df=pd.DataFrame(data)
pv=pd.pivot(df,index='Year',columns='team',values='Runs')
print (df)
print (pv)

KeyError: 'team'

In [3]:
import pandas as pd
data={
'Year':['2018','2019','2018','2019','2018','2019'],
'Team':['MI','MI','RCB','RCB','CSK','CSK'],
'Runs':[2500,2650,2200,2400,2300,2700]}
df=pd.DataFrame(data)
pv=pd.pivot(df,index='Year',columns='Team',values='Runs')
print (df)
print (pv)

   Year Team  Runs
0  2018   MI  2500
1  2019   MI  2650
2  2018  RCB  2200
3  2019  RCB  2400
4  2018  CSK  2300
5  2019  CSK  2700
Team   CSK    MI   RCB
Year
2018  2300  2500  2200
2019  2700  2650  2400

In [8]:
import pandas as pd
data={
    "city":["pune","bombay","chennai"],
    "MARKS":[90,95,85],
    "department":["computer","science","english"]}

df=pd.DataFrame(data)
# pv=pd.pivot(df,index="city",columns="department",values="MARKS")
# print(df)
# print(pv)

      city  MARKS department
0     pune     90   computer
1   bombay     95    science
2  chennai     85    english
department  computer  english  science
city
bombay           NaN      NaN     95.0
chennai          NaN     85.0      NaN
pune            90.0      NaN      NaN

In [12]:
data1={
    "city":["DSFDS","bSDFSDbay","chSDFDSFennai"],
    "MARKS":[90,95,85],
    "department":["coSDFSmputer","scSDFSDFience","eSDFSDFnglish"]}
df1=pd.DataFrame(data1)

In [10]:
df

      city  MARKS department
0     pune     90   computer
1   bombay     95    science
2  chennai     85    english

In [13]:
df1

            city  MARKS     department
0          DSFDS     90   coSDFSmputer
1      bSDFSDbay     95  scSDFSDFience
2  chSDFDSFennai     85  eSDFSDFnglish

In [15]:
main_data = pd.concat([df,df1],axis=0)
main_data

            city  MARKS     department
0           pune     90       computer
1         bombay     95        science
2        chennai     85        english
0          DSFDS     90   coSDFSmputer
1      bSDFSDbay     95  scSDFSDFience
2  chSDFDSFennai     85  eSDFSDFnglish

In [34]:
import pandas as  pd
d1=({
    "id":[1,2,3,4],
    "name":["tom","jerry","james","jan"]
})
dataframe=pd.DataFrame(d1)
dataframe

   id   name
0   1    tom
1   2  jerry
2   3  james
3   4    jan

In [33]:
import pandas as pd
d2=({
    "id":[1,5,6,4],
    "age":[31,20,40,70],
    "sex":["f","m","m","f"]
}) 
user1=pd.DataFrame(d2)
user1

   id  age sex
0   1   31   f
1   5   20   m
2   6   40   m
3   4   70   f

In [40]:
d3=pd.merge(dataframe,user1,on='id',how='right')
d3

   id name  age sex
0   1  tom   31   f
1   5  NaN   20   m
2   6  NaN   40   m
3   4  jan   70   f

In [41]:
d3=pd.merge(dataframe,user1,on='id',how='left')
d3

   id   name   age  sex
0   1    tom  31.0    f
1   2  jerry   NaN  NaN
2   3  james   NaN  NaN
3   4    jan  70.0    f

In [15]:
userdata=pd.concat([dataframe,user1],axis=1)
print(userdata)

   id   name  id  age sex
0   1    tom   2   31   f
1   2  jerry   3   20   m
2   3  james   4   40   m
3   4    jan   5   70   f

In [16]:
userdata=pd.merge(dataframe,user1,on="id",how="left")
print(userdata)

   id   name   age  sex
0   1    tom   NaN  NaN
1   2  jerry  31.0    f
2   3  james  20.0    m
3   4    jan  40.0    m